FriendRequest/FriendRequest.getInfo.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns="urn:FriendRequest">
 <SOAP-ENV:Body>
  <ns:getInfo>
   <fr>
    <Id-sender>1</Id-sender>
    <Id-receiver>2</Id-receiver>
   </fr>
  </ns:getInfo>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
